---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableErrorInfo.#ctor
source: html/f392dfe6-222c-1679-81dd-862ba17a0797.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorInfo.#ctor Method

Constructs a new FamilySizeTableErrorInfo with default settings.

## Syntax (C#)
```csharp
public FamilySizeTableErrorInfo()
```